am/OpenFOAM-10/tutorials/multiphase/multiphaseEulerFoam/RAS/pipeBend/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application       multiphaseEulerFoam;

startFrom         latestTime;

startTime         0;

stopAt            endTime;

endTime           2;

deltaT            0.003;

writeControl      adjustableRunTime;

writeInterval     0.1;

purgeWrite        0;

writeFormat       ascii;

writePrecision    6;

writeCompression  off;

timeFormat        general;

timePrecision     6;

runTimeModifiable yes;

adjustTimeStep    yes;

maxCo             1;

maxDeltaT         1;

functions
{
    #includeFunc writeObjects(d.particles)

    #includeFunc populationBalanceSizeDistribution
    (
        populationBalance=agglomerates,
        regionType=cellZone,
        name=afterBend_1d,
        functionType=volumeDensity,
        coordinateType=diameter,
        normalise=yes,
        funcName=probabilityDensity.afterBend_1d
    )

    #includeFunc populationBalanceSizeDistribution
    (
        populationBalance=agglomerates,
        regionType=cellZone,
        name=afterBend_5d,
        functionType=volumeDensity,
        coordinateType=diameter,
        normalise=yes,
        funcName=probabilityDensity.afterBend_5d
    )

    #includeFunc populationBalanceSizeDistribution
    (
        populationBalance=agglomerates,
        regionType=cellZone,
        name=afterBend_9d,
        functionType=volumeDensity,
        coordinateType=diameter,
        normalise=yes,
        funcName=probabilityDensity.afterBend_9d
    )

    #includeFunc populationBalanceSizeDistribution
    (
        populationBalance=agglomerates,
        regionType=cellZone,
        name=beforeBend_1d,
        functionType=volumeDensity,
        coordinateType=diameter,
        normalise=yes,
        funcName=probabilityDensity.beforeBend_1d
    )
}


// ************************************************************************* //
