am/OpenFOAM-10/tutorials/multiphase/multiphaseEulerFoam/RAS/pipeBend/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Mesh
runApplication blockMesh
runApplication topoSet

# Run
runApplication decomposePar
runParallel $(getApplication)
runApplication reconstructPar -latestTime

# Post-process
runApplication postProcess -func "
    graphLayerAverage
    (
        funcName=graphCrossSection,
        patches=(inlet),
        axis=distance,
        d.particles
    )
    " -latestTime
cd validation && ./createGraphs

#------------------------------------------------------------------------------
